Repository: 84000/data-translation-memory
Catalog: toh56-v4.tmx
Source language: bo
Languages: en

source: གཞན་ཡང་ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སྦྱིན་པ་དེ་གཞན་རྣམ་པ་བཅུས་ཡོངས་སུ་དག་པར་སྦྱིན་པར་བྱེད་དེ། བཅུ་གང་ཞེ་ན། ཇི་ཙམ་འདུས་བྱས་ལས་ངེས་པར་འབྱུང་བ་དང་། འདུས་མ་བྱས་ཐོབ་པར་བྱ་བའི་ཕྱིར་དེ་ལྟར་སྦྱིན་པ་བྱིན་ན། ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའི་སྦྱིན་པའི་ཕན་ཡོན་བཅུ་འཐོབ་པར་འགྱུར་རོ། ། བཅུ་གང་ཞེ་ན། བཟའ་བ་བྱིན་པས་ཚེ་དང་། སྤོབས་པ་དང་། བདེ་བ་དང་། སྟོབས་དང་། ཁ་དོག་ཕུན་སུམ་ཚོགས་པ་རབ་ཏུ་འཐོབ་བོ། །བཏུང་བ་བྱིན་པས་ཉོན་མོངས་པ་དང་། སྲེད་པ་ཐམས་ཅད་བསལ་བ་ཕུན་སུམ་ཚོགས་པ་རབ་ཏུ་འཐོབ་བོ། །བཞོན་པ་བྱིན་པས་བདེ་བ་ཐམས་ཅད་ཀྱི་དངོས་པོ་ཕུན་སུམ་ཚོགས་པ་རབ་ཏུ་འཐོབ་བོ། །བགོ་བ་བྱིན་པས་ཁྲེལ་ཡོད་པ་དང་། ངོ་ཚ་ཤེས་པ་དང་། གསེར་ལྟར་ཁ་དོག་ཡོངས་སུ་དག་པ་ཕུན་སུམ་ཚོགས་པ་རབ་ཏུ་འཐོབ་བོ། སྤོས་དང་ཕྲེང་བ་བྱིན་པས་ཚུལ་ཁྲིམས་དང་། ཐོས་པ་དང་། ཏིང་ངེ་འཛིན་གྱི་དྲི་དང་། བྱུག་པ་ཕུན་སུམ་ཚོགས་པ་རབ་ཏུ་འཐོབ་བོ། །དྲི་རབ་ཏུ་ཞིམ་པའི་སྤོས་དང་། ཕྱེ་མ་དང་། བྱུག་པ་བྱིན་པས་ལུས་ཀྱི་ནན་ཏན་གྱི་དྲི་ཞིམ་པོ་ཕུན་སུམ་ཚོགས་པ་རབ་ཏུ་འཐོབ་བོ། །རོ་བྱིན་པས་རོ་བྲོ་བའི་ནང་ན་མཆོག་གི་རོ་བྲོ་བའི་སྐྱེས་བུ་ཆེན་པོའི་མཚན་ཕུན་སུམ་ཚོགས་པ་རབ་ཏུ་འཐོབ་བོ། །གནས་བྱིན་པས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་གནས་དང་། རྟེན་དང་། གླིང་དང་། སྐྱབས་དང་། དཔུང་གཉེན་ཕུན་སུམ་ཚོགས་པ་རབ་ཏུ་འཐོབ་བོ། ནད་པ་ལ་སྨན་བྱིན་པས་མི་རྒ་མི་འཆི་ཤི་བ་མེད་པའི་བདེ་བ་ཡོངས་སུ་རྫོགས་པ་ཕུན་སུམ་ཚོགས་པ་རབ་ཏུ་འཐོབ་བོ། །ཡོ་བྱད་སྣ་ཚོགས་བྱིན་པས་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་ཀྱི་ཡོ་བྱད་ཡོངས་སུ་རྫོགས་པ་ཕུན་སུམ་ཚོགས་པ་རབ་ཏུ་འཐོབ་སྟེ ཤྭ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་འདོད་པས་དེ་ལྟར་སྦྱིན་པ་བྱིན་ན་སྦྱིན་པའི་ཕན་ཡོན་བཅུ་པོ་དེ་དག་ཡོངས་སུ་གཟུང་བར་འགྱུར་རོ། །
en: “Further, Śāriputra, he gives that gift as purified because of ten other features. What are they? If the giving is done for the purpose of escaping the conditioned and reaching the unconditioned, then, Śāriputra, the bodhisatva gains ten advantages from being generous. What are they? By giving food he will gain perfect vitality, eloquence, happiness, power, and status. By giving drink he will gain the complete removal of all afflictions and craving. By giving vehicles he will gain perfect possessions that will bring him pleasure. By giving clothes he will gain perfect modesty, humility, and a golden complexion. By giving fragrances and garlands he will gain perfect fragrance-anointed morality, learning, and concentration. By giving pleasant fragrances, powders, and ointments he will gain a perfectly energetic and sweet-smelling body. By giving flavors he will experience the most exquisite tastes in the world and gain the perfect characteristics of a great man. By giving shelter he will gain a perfect resting place, a shelter, a sanctuary, an abode, and a refuge for all sentient beings. By giving medicine for the sick he will gain the perfect complete happiness of immortality without aging and death. By giving various utensils he will gain the perfect tools conducive to awakening, the complete Dharma. Śāriputra, when the bodhisatva who longs for awakening is generous in this way, he will obtain these ten advantages.

source: གཞན་ཡང་ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཕན་ཡོན་གཞན་བཅུ་རབ་ཏུ་འཐོབ་བོ། །བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། མར་མེ་བྱིན་པས་དེ་བཞིན་གཤེགས་པའི་སྤྱན་ལྔ་ཡོངས་སུ་དག་པ་ཕུན་སུམ་ཚོགས་པ་རབ་ཏུ་འཐོབ་བོ། །སིལ་སྙན་བྱིན་པས་ལྷའི་རྣ་བ་ཡོངས་སུ་དག་པ་ཕུན་སུམ་ཚོགས་པ་རབ་ཏུ་འཐོབ་བོ། །གསེར་དང་། ནོར་བུ་དང་། མུ་ཏིག་དང་། བཻ་དཱུརྱ་དང་། དུང་དང་། མན་ཤེལ་དང་། བྱི་རུ་དང་། རིན་པོ་ཆེ་ཐམས་ཅད་བྱིན་པས་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཡོངས་སུ་རྫོགས་པ་ཕུན་སུམ་ཚོགས་པ་རབ་ཏུ་འཐོབ་བོ། །རིན་པོ་ཆེ་ཐ་དད་པ་སྣ་ཚོགས་དང་། མེ་ཏོག་སྣ་ཚོགས་བྱིན་པས་དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུ་ཡོངས་སུ་རྫོགས་པ་ཕུན་སུམ་ཚོགས་པ་རབ་ཏུ་འཐོབ་བོ། །རྟ་དང་། གླང་པོ་ཆེ་དང་། ཤིང་རྟ་བྱིན་པས་རྒྱས་པ་དང་། ཡངས་པ་དང་ཆེ་བ་ཕུན་སུམ་ཚོགས་པ་རབ་ཏུ་འཐོབ་བོ། །སྐྱེད་མོས་ཚལ་དང་། དཀའ་ཐུབ་ཀྱི་ནགས་ཚལ་བྱིན་པས་བསམ་གཏན་དང་། རྣམ་པར་ཐར་པ་དང་། ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པ་ཡོངས་སུ་རྫོགས་པ་ཕུན་སུམ་ཚོགས་པ་རབ་ཏུ་འཐོབ་བོ། །ནོར་དང་། འབྲུ་དང་། མཛོད་དང་། བང་བ་བྱིན་པས་ཆོས་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་མཛོད་ཡོངས་སུ་རྫོགས་པ་ཕུན་སུམ་ཚོགས་པ་རབ་ཏུ་འཐོབ་བོ། །བྲན་ཕོ་དང་། བྲན་མོ་དང་། ལས་བྱེད་པའི་མི་བྱིན་པས་རང་ཉམ་དང་། རང་དབང་དང་། རང་བྱུང་གི་ཡེ་ཤེས་ཡོངས་སུ་རྫོགས་པ་ཕུན་སུམ་ཚོགས་པ་རབ་ཏུ་འཐོབ་བོ། །བུ་ཕོ་དང་། བུ་མོ་བྱིན་པས་མཛའ་བ་དང་། སྡུག་པ་དང་། འདོད་པའི་བླ་ན་ མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡོངས་སུ་རྫོགས་པ་ཕུན་སུམ་ཚོགས་པ་རབ་ཏུ་འཐོབ་བོ། །གླིང་བཞིའི་རྒྱལ་པོའི་ལོངས་སྤྱོད་ཐམས་ཅད་བྱིན་པས་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པའི་མཆོག་ཐམས་ཅད་དང་ལྡན་པའི་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཕུན་སུམ་ཚོགས་པ་རབ་ཏུ་འཐོབ་སྟེ ཤ་རིའི་བུ་ཕན་ཡོན་བཅུ་པོ་དེ་དག་ཡོངས་སུ་གཟུང་བར་འགྱུར་རོ། །
en: “Śāriputra, there is a further set of ten advantages that the bodhisatva will gain. What are they? By giving lamps he will gain a tathāgata’s five kinds of perfect, pure vision. By giving music he will gain perfect, pure divine hearing. By giving all types of precious substances—gold, jewels, pearls, gems, conches, crystals, and coral—he will gain the perfect, complete thirty-two characteristics of a great being. By giving a variety of different kinds of riches and various kinds of flowers he will gain the perfect complete eighty minor marks. By giving horses, elephants, and chariots he will gain vast tracts of land. By giving parks and hermitages he will gain the perfect complete liberative meditative states, the attainments of concentration. By giving treasure, grain, stocks, and storerooms he will gain the perfect complete treasury of all precious Dharma teachings. By giving male and female servants, workers, or laborers he will gain perfect complete freedom, independence, and spontaneous knowledge. By giving sons and daughters he will gain what he wants, what he longs for and desires: perfectly complete supreme full awakening. By giving all the resources of the kings of the four continents, the bodhisatva will gain the perfect knowledge of omniscience, with all supreme qualities. These, Śāriputra, are the ten advantages he will obtain.

source: ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་འདོད་པས་དེ་ལྟར་སྦྱིན་པ་བྱིན་ན་ཕན་ཡོན་གཞན་ཡང་བཅུ་འཐོབ་བོ། །བཅུ་གང་ཞེ་ན། འདོད་པའི་ཡོན་ཏན་ལྔ་བྱིན་པས་ཚུལ་ཁྲིམས་དང་། ཏིང་ངེ་འཛིན་དང་། ཤེས་རབ་དང་། རྣམ་པར་གྲོལ་བ་དང་རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བའི་ཕུང་པོ་ཡོངས་སུ་དག་པ་ཕུན་སུམ་ཚོགས་པ་རབ་ཏུ་འཐོབ་བོ། །དགའ་བའི་རྩེད་མོ་ཐམས་ཅད་ཡོངས་སུ་གཏོང་བའི་སྦྱིན་པས་དམ་པའི་ཆོས་ཀྱི་དགའ་བ་དང་། རྩེ་བ་ཡོངས་སུ་དག་པ་ཕུན་སུམ་ཚོགས་པ་རབ་ཏུ་འཐོབ་བོ། །རྐང་པ་བྱིན་པས་ཆོས་ཀྱི་དོན་གྱི་རྐང་པ་བྱང་ཆུབ་ཀྱི་སྙིང་པོར་འགྲོ་བ་ཡོངས་སུ་རྫོགས་པ་ཕུན་སུམ་ཚོགས་པ་རབ་ཏུ་འཐོབ་བོ། །ལག་པ་བྱིན་པས་སེམས་ཅན་ཐམས་ཅད་ལ་ཆོས་ཀྱི་ལག་པ་རབ་ཏུ་སྦྱིན་པ་ཡོངས་སུ་རྫོགས་པ་ཕུན་སུམ་ཚོགས་པ་རབ་ཏུ་འཐོབ་བོ། །རྣ་བ་དང་། སྣ་བྱིན་པས་དབང་པོ་མ་ཚང་བ་མེད་ཅིང་ཡོངས་སུ་རྫོགས་པ་ཕུན་སུམ་ཚོགས་པ་རབ་ཏུ་འཐོབ་བོ། །ཡན་ལག་དང་ཉིང་ལག་བྱིན་པས་ཁ་ན་མ་ཐོ་བ་མེད་ཅིང་མཛེས་པའི་ཡན་ལག་སངས་རྒྱས་ཀྱི་སྐུ་ཡོངས་སུ་རྫོགས་པ་ཕུན་སུམ་ཚོགས་པ་རབ་ཏུ་འཐོབ་བོ། །མིག་བྱིན་པས་སེམས་ཅན་ཐམས་ཅད་ལ་ཆོས་ཀྱི་མིག་མི་སྒྲིབ་པ་ཡོངས་སུ་དག་པ་ཕུན་སུམ་ཚོགས་པ་རབ་ཏུ་འཐོབ་བོ། །ཤ་དང་ཁྲག་བྱིན་པས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལུས་དང་སྲོག་སྙིང་པོ་མེད་པ་ལས་སྙིང་པོ་ལེན་པས་ཉེ་བར་འཚོ་བ་ལ་མཁས་པ་ཕུན་སུམ་ཚོགས་པར་རབ་ཏུ་འཐོབ་བོ། །རྐང་བྱིན་པས་རྡོ་རྗེ་ལྟར་མི་ཤིགས་པའི་ལུས་འཐོབ་པ་ཕུན་སུམ་ཚོགས་པ་རབ་ཏུ་འཐོབ་བོ། །ཡན་ལག་གི་དམ་པ་མགོ་བྱིན་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཇིག་རྟེན་གསུམ་གྱི་མཆོག་བླ་ན་ མེད་ཅིང་ལྟག་ན་མེད་པའི་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཁོང་དུ་ཆུད་པ་ཡོངས་སུ་རྫོགས་པ་ཕུན་སུམ་ཚོགས་པ་རབ་ཏུ་འཐོབ་སྟེ ཤྭ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་འདོད་པས་དེ་ལྟར་སྦྱིན་པ་བྱིན་ན་འདི་ལྟ་བུའི་སངས་རྒྱས་ཀྱི་ཆོས་ཡོངས་སུ་རྫོགས་པའི་ཕན་ཡོན་དེ་དག་ཡོངས་སུ་གཟུང་བར་འགྱུར་རོ། །
en: “If he gives in this manner, Śāriputra, the bodhisatva who gives and longs for awakening will gain a further ten advantages. What are they? By giving the pleasures of the five senses he will gain perfectly pure morality, concentration, wisdom, liberation, and insight into the knowledge of liberation. By giving up all joys and amusements he will gain the perfectly pure joys and amusements of the true Dharma. By giving his legs he will gain the completely perfect legs of Dharma that carry one toward the seat of awakening. By giving his hands he will gain the hand of Dharma, the most perfect means of giving to all sentient beings. By giving his ears and nose he will gain completely perfect unimpaired senses. By giving his major and minor limbs he will gain the perfect complete body of a buddha with supreme, irreproachable limbs. By giving his eyes he will gain the perfectly pure eye of the Dharma that has unobstructed access to all sentient beings. By giving his flesh and blood he will gain perfect experience of the way all sentient beings rely on the belief that the body and life force have an essence when in fact they are without essence. By giving his bones he will gain perfect attainment of the unbreakable vajra body. By giving the supreme limb, his head, the bodhisatva, the great being, will gain perfect realization, supreme and unsurpassed omniscient knowledge, truly outstanding in the three realms. Śāriputra, when the bodhisatva who longs for awakening is generous in this way, he will obtain these advantages, the perfect characteristics of a buddha.

source: ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་མཁས་པ་ཟབ་པ་ཤེས་རབ་ཀྱི་སྣང་བ་ནི་འཇིག་རྟེན་གྱི་ཟང་ཟིང་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་འདོད། བདུད་རྩི་འདོད། སྙིང་པོ་འདོད། བྱང་ཆུབ་འདོད་དེ། ཡང་ཤཱ་རིའི་བུ་མྱ་ངན་ལས་འདས་པ་འདོད་པ་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་གནས་ཏེ། འཇིག་རྟེན་གྱི་ཟང་ཟིང་སྦྱིན་པ་ན་འཇིག་རྟེན་གྱི་བདེ་བ་ཐམས་ཅད་ཡོངས་སུ་མི་གཏོང་བ་གང་ཡང་མེད་དོ། །
en: “Śāriputra, the learned bodhisatva of profound wisdom longs for unsurpassed perfect awakening from mundane concerns. He longs for deathlessness. He longs for the essential. He longs for awakening. Śāriputra, the bodhisatva who longs for nirvāṇa gives away material things, but as he takes supreme perfect awakening as his support, there are in fact no mundane concerns that he has to give up; there are in fact no worldly objects that he has to give up.

source: འདི་ལྟ་སྟེ། ཤཱ་རིའི་བུ་ཁྱིམ་བདག་ཆུན་པ་ཞིང་སྐམས་ལ་གནས་ནས་བ་ལང་དང་། གནམ་སྡོང་མ་ཡིན་པའི་ཞིང་གི་རྨོ་བརྐོ་རྫོགས་པར་བྱས་ཏེ། ས་བོན་བཏབ་ནས་རྣམ་གྲངས་འདིས་གཤོལ་གྱིས་འཚོ་བས་གསེར་དང་། དངུལ་ཡང་འགྲུབ་བོ། །དངོས་པོ་སྣ་ཚོགས་གཞན་ཡང་འགྲུབ་བོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཤཱ་རིའི་བུ་འབྲུ་དང་མཚུངས་པའི་ནོར་མེད་དོ། ། ཤཱ་རིའི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་འདི་ལྟར་འཇིག་རྟེན་གྱི་ཟང་ཟིང་ལ་གནས་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བའི་དུས་དང་ཚོད་ཡོད་དོ། ། འདི་ལྟ་སྟེ། ཤཱ་རིའི་བུ་བས་རྩྭ་སྐམ་པོ་དང་། གཤེར་བ་ཟོས་པ་དང་། ཆུ་གྲང་མོ་དང་། དྲོན་མོ་འཐུངས་པ་དེ་ལས་འོ་མ་འགྲུབ་སྟེ། ཞོ་དང་། མར་སར་པ་དང་། མར་གྱི་སྙིང་པོ་ཡང་འགྲུབ་བོ།
en: “Śāriputra, take the example of a farmer who, relying on a dry piece of land, works the land with an ox, making furrows in the soil made fertile by the divine rain, and then plants seeds. By basing his survival on the plow, the various conditions that are put in place will eventually yield gold and silver for him. They will result in a variety of other things. Why is this? Śāriputra, it is because there is nothing like the wealth of grain. Likewise, Śāriputra, eventually, in due time, the bodhisatva will accomplish unsurpassed perfect awakening by relying on the material world.

source: ཤཱ་རིའི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་གནས་ཏེ འཇིག་རྟེན་གྱི་ཟང་ཟིང་སྦྱིན་པ་ན། དེ་མི་འདོད་ཀྱང་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ཡང་ཡོངས་སུ་འགྲུབ་བོ། །བརྒྱ་བྱིན་དང་། ཚངས་པ་ཡང་འགྲུབ་བོ། །གནས་དེ་ གསུམ་ཡོངས་སུ་གྲུབ་ནས་ བྱང་ཆུབ་སེམས་དཔའི་ས་བཅུ་ཡོངས་སུ་འགྲུབ་བོ། །དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་ཡང་ཡོངས་སུ་འགྲུབ་བོ། །ལས་སྟོང་གིས་འགྲུབ་པའི་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་རྣམས་ཀྱང་ཡོངས་སུ་འགྲུབ་བོ། །ལས་སྟོང་གིས་འགྲུབ་པའི་རྣམ་པ་དྲུག་ཅུ་དང་ལྡན་པའི་དབྱངས་ཕུན་སུམ་ཚོགས་པ་ཡང་ཡོངས་སུ་འགྲུབ་བོ། ལས་བརྒྱས་འགྲུབ་པའི་སྐྱེས་བུ་ཆེན་པོའི་མཚན་གཅིག་ཡོངས་སུ་འགྲུབ་བོ། །ལས་ཉིས་བརྒྱས་འགྲུབ་པའི་གཙུག་ཏོར་སྤྱི་བོར་འགྲུབ་བོ། །རྣམ་པ་དང་ཡོན་ཏན་བརྒྱས་ཡོངས་སུ་རྫོགས་པའི་དེ་བཞིན་གཤེགས་པའི་ཆོས་ཀྱི་དུང་ཆེན་པོ་ཡང་འགྲུབ་བོ། །རྣམ་པ་བྱེ་བ་དང་། ཡོན་ཏན་བརྒྱ་ཕྲག་སྟོང་དང་ལྡན་པའི་ཚེམས་ཀྱི་ཕྲེང་བ་ཐགས་བཟང་བ། ཕྲག་མེད་པ་སྙོམས་ཤིང་དཀར་བ་ཡང་ཡོངས་སུ་འགྲུབ་སྟེ དེ་ལྟར་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་རྣམས་དེ་བཞིན་གཤེགས་པའི་ལས་ཀྱི་འབྲས་བུ་རྣམ་པར་སྨིན་པས་མངོན་པར་འགྲུབ་བོ། །
en: “Śāriputra, take the example of a cow who is fed moist and dry hay and who drinks cold and warm water. It will produce milk, which can be fermented into yogurt or churned into butter. Likewise, Śāriputra, the bodhisatva, the great being, gives material worldly objects, and as he takes unsurpassed perfect awakening as his reference point, he will become a king of the entire world, even though he does not desire it. He will even attain the state of Śakra and Brahmā. Through his mastery of those three states, he will accomplish the ten stages of the bodhisatva path. He will attain the ten powers and the four kinds of confidence. He will manifest the eighteen unique buddha qualities that are the result of a thousand deeds. He will manifest perfect speech with sixty characteristics that is the result of a thousand deeds. He will manifest the unique characteristic of a great being that is the result of a hundred deeds. He will develop a crown protrusion that is the result of two hundred deeds. He will manifest the blast of the conch shell of the great Dharma of the tathāgatas complete with a hundred features and qualities. He will display an unbroken, faultless, even row of white teeth with ten million features and a hundred thousand qualities. Then, Śāriputra, he will have reached the goal of tathāgatahood, the ripened fruit of tathāgata actions.

source: ཡང་ཤཱ་རིའི་བུ་གང་བྱམས་པའི་སེམས་བསྐྱེད་ནས་སློང་བ་ལ་སྦྱིན་པ་བྱིན་པ་དེ་ནི་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དུ་སེམས་བསྐྱེད་པས་སངས་རྒྱས་ཀྱི་ཏིང་ངེ་འཛིན་རྒྱུན་མི་འཆད་པ་གཅིག་འགྲུབ་སྟེ ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ནས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བ་སྤུའི་བུ་ག་རེ་རེ་ནས་ཏིང་ངེ་འཛིན་བརྒྱ་གང་གཱའི་རྒྱུན་ལྟར་མངོན་པར་སྤྲུལ་པ་མཛད་དེ། ། ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་ནི་རྫུ་འཕྲུལ་གྱི་བྱ་བ་ཐམས་ཅད་ལ་དབང་ཐོབ་པའོ། །
en: “Śāriputra, as he has given rise to a loving mind and is generous, giving to those who request it, he develops a mental state that is as vast as the grains of sand in the river Ganges are numerous, and he therefore accomplishes the unique, unbroken concentration of a buddha. Dwelling in this concentration, the tathāgata, arhat, fully accomplished Buddha will manifest a hundred concentrations as Ganges-like streams from each of the pores of his body. As a tathāgata, Śāriputra, he has mastered all types of magical techniques.

source: ཤཱ་རིའི་བུ་གང་འདི་ལྟ་བུའི་སངས་རྒྱས་ཀྱི་ཆོས་དེ་དག་ནི་དེ་བཞིན་གཤེགས་པ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་འཇིག་རྟེན་གྱི་ཟང་ཟིང་གི་སྦྱིན་པས་ཡོངས་སུ་བཟུང་བ་ཡིན་ནོ། ། ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་མི་འཆི་བ་འདོད་པ་དང་། བྱང་ཆུབ་འདོད་པ་དང་། །མྱ་ངན་ལས་འདས་པ་འདོད་པ་ནི་འཇིག་རྟེན་གྱི་ཟང་ཟིང་སྦྱིན་པར་བྱེད་དོ། །
en: “These are the buddha qualities, Śāriputra, that are the outcome of training according to the way of the bodhisatva and that he will take hold of as a tathāgata, as he has been generous with worldly material objects. Śāriputra, longing for the deathless, longing for the essential, longing for awakening, longing for nirvāṇa, the bodhisatva gives material worldly objects. So, Śāriputra, you ought to take to heart that this is the way of things, that the bodhisatva will realize unsurpassed perfect awakening by relying on the material world.

source: ཤཱ་རིའི་བུ་རྣམ་གྲངས་དེས་ན་ཁྱོད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་འཇིག་རྟེན་གྱི་ཟང་ཟིང་ལ་གནས་ནས་ བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་རིག་པར་གྱིས་ཤིག །ཤཱ་རིའི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ཀྱི་བསྐལ་པ་གྲངས་མེད་པ་ཤིན་ཏུ་གྲངས་མེད་པ་ཚད་མེད་པ། བསམ་གྱིས་མི་ཁྱབ་པ་གང་བྱུང་བ་དེའི་ཚེ་དེའི་དུས་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཆོས་མོས་ཞེས་བྱ་བ། རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ་བླ་ན་ མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་འཇིག་རྟེན་དུ་བྱུང་ངོ་། །ཡང་ཤཱ་རིའི་བུ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཆོས་མོས་ཀྱི་ཚེའི་ཚད་ནི་ལོ་སྟོང་ཕྲག་བཅུར་གྱུར་ཏོ། །
en: “At one time, Śāriputra, a great many uncountable, inconceivable, innumerable eons upon innumerable eons ago, a tathāgata, arhat, fully accomplished buddha by the name of Bhāṅgīrasi, appeared in the world. He was perfect in wisdom and conduct, and he was a sugata, a knower of the world, an unsurpassable guide for those who wished to train, a teacher of gods and men, awakened, a lord. Now, Śāriputra, the Lord, the Tathāgata Bhāṅgīrasi, reached the ripe age of ten thousand. Śāriputra, the Tathāgata Bhāṅgīrasi had a hundred thousand mendicants, arhats who had eliminated the vices, who possessed powers and had reached the very highest level of complete mastery of the mind—a great assembly of śrāvakas.

source: ཡང་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་ཆོས་མོས་དེའི་དགེ་སློང་སྟོང་ཕྲག་བརྒྱ་ནི་དགྲ་བཅོམ་པ། ཉོན་མོངས་པ་མེད་པ། དབང་དང་ལྡན་པར་གྱུར་པ་ནས། སེམས་ཀྱི་དབང་ཐམས་ཅད་ཀྱི་དམ་པའི་ཕ་རོལ་ཏུ་སོན་པའི་བར་དུ་སྟེ། དགྲ་བཅོམ་པ་ཤ་སྟག་གི་འདུས་པ་ཆེན་པོ་བྱུང་ངོ་། ། ཤཱ་རིའི་བུ་དེའི་ཚེ་ཐག་པ་ཞེས་བྱ་བ་ཐགས་འཐག་པ། གཟུགས་བཟང་བ། མཛེས་པ། བལྟ་ན་ སྡུག་པ། མདོག་བཟང་ཞིང་རྒྱས་པའི་མཆོག་དང་ལྡན་པ་ཞིག་བྱུང་སྟེ དེ་དེ་བཞིན་གཤེགས་པ་ཆོས་མོས་གང་ན་བཞུགས་པའི་ས་ཕྱོགས་དེ་ནས་ཧ་ཅང་ཡང་མི་རིང་བའི་ས་ཕྱོགས་ཞིག་ན་རང་གི་ལས་བྱེད་དོ། ། དེ་ཉིན་པར་ལས་བྱས་ནས་ ནུབ་ཀར་ཁྱིམ་དུ་འགྲོ་བའི་ཚེ་རྟག་ཏུ་དུས་ཐམས་ཅད་དུ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཆོས་མོས་དེ འི་དྲུང་དུ་འོངས་ནས་ རས་ཀྱི་ཁ་ཚར་གཅིག་འབུལ་ཅིང་འདི་སྐད་ཅེས་གསོལ་ཏོ། ། བཅོམ་ལྡན་འདས་བསྡུ་བའི་གནས་ཀྱིས་བདག་བཅོམ་ལྡན་འདས་ལ་རས་ཀྱི་ཁ་ཚར་ཕུལ་བའི་དགེ་བའི་རྩ་བ་དེས་བདག་མ་འོངས་པའི་དུས་ན་བསྡུ་བ་ཐམས་ཅད་དང་ལྡན་པའི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སུ་གྱུར་ཅིག་ཅེས་དེས་རིམ་གྱིས་རས་ཀྱི་ཁ་ཚར་སྟོང་ལྔ་བརྒྱ་ཕུལ་ཏེ དེས་བསྐལ་པ་བྱེ་བ་ཕྲག་བཅོ་ལྔར་ངན་འགྲོ་ལོག་པར་ལྟུང་བར་མ་སོང་ངོ་། ། དགེ་བའི་རྩ་བ་དེ་ཉིད་ཀྱིས་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་བྱེ་བ་ཕྲག་སྟོང་མྱོང་ངོ་། ། དེ་དགེ་བའི་རྩ་བ་དེ་ཉིད་ཀྱིས་བརྒྱ་བྱིན་གྱི་བདག་པོ་བྱེ་བ་ཕྲག་སྟོང་མྱོང་ངོ་། ། དགེ་བའི་རྩ་བ་འཇམ་པ་ཡིད་དུ་འོང་བ་དང་པོ་པའི་ལས་དེ་ཉིད་ཀྱིས་སངས་རྒྱས་བྱེ་བ་ཕྲག་སྟོང་མཉེས་པར་བྱས་ཏེ། དེས་ཐམས་ཅད་ལ་མེ་ཏོག་དང་། བདུག་པ་དང་། སྤོས་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ཆོས་གོས་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། གོས་དང་། ཞལ་ཟས་དང་། མལ་ཆ་དང་། ན་བའི་གསོས་སྨན་དང་། ཡོ་བྱད་ཀྱིས་བསྟི་སྟང་དུ་བྱས། བླ་མར་བྱས། རི་མོར་བྱས་ནས་མཆོད་དོ། ། དེ་ཕྱིར་བསྐལ་པ་གྲངས་མེད་པ་ཞིག་ན་བླ་ན་མེད་པ་ཡང་དག་པར་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། རབ་ཏུ་བསྡུས་པ་ཞེས་བྱ་བའི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འཇིག་རྟེན་དུ་བྱུང་བ་ནས། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཞེས་བྱ་བའི་བར་དུ་སྟེ། དེ་ལོ་བྱེ་བ་ཕྲག་ཉི་ཤུའི་བར་དུ་གནས་སོ། ། དེའི་དགྲ་བཅོམ་པ་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་ཉི་ཤུ་ཟག་པ་ཟད་པ། ཉོན་མོངས་པ་མེད་པ། དབང་དང་ལྡན་པར་གྱུར་པ་ནས། སེམས་ཀྱི་དབང་ཐམས་ཅད་ཀྱི་དམ་པའི་ཕ་རོལ་ཏུ་སོན་པའི་བར་གྱི་ཉན་ཐོས་འདུས་པ་ཆེན་པོ་བྱུང་ངོ་། ། བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཕྲག་ལྔ་ཡང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་བཀོད་དོ། ། དེས་ཆོས་བསྟན་ཏེ་སེམས་ཅན་གྲངས་མེད་དཔག་ཏུ་མེད་པའི་དོན་བྱས་ནས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་སོ། ། དེར་བཅོམ་ལྡན་འདས་དེ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས། ལོ་སྟོང་གི་བར་དུ་དམ་པའི་ཆོས་གནས་སོ། ། དེའི་སྐུ་གདུང་ཡང་རྒྱས་པར་གྱུར་ཏེ། འདི་ལྟ་སྟེ། དཔེར་ན་ཤཱ་རིའི་བུ་ང་ད་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར་བ་བཞིན་ནོ། །
en: “At that time, Śāriputra, there was a weaver by the name of Sūtracunaka. He was beautiful, handsome, pleasant to behold, and possessed an abundance of excellent and splendid features. The Lord, the Tathāgata Bhāṅgīrasi, was dwelling in an area that was not very far from his place of work. When the day’s work was ended and he was on his way home in the evening, it was always his habit to visit the Lord, the Tathāgata Bhāṅgīrasi, and offer him some woven fabric. He would then proclaim, ‘Lord, as I make this offering of woven fabric through your inspiration, may I, Lord, be able to develop in future all the necessary roots of virtue to become a tathāgata, an arhat, a fully accomplished buddha.’ As a consequence of having made one thousand five hundred gifts of woven fabric, he did not fall into the lower realms for five hundred million eons. With these roots of virtue, he enjoyed the state of a king of the entire world for a billion eons. With these roots of virtue, he enjoyed the powerful state of Śakra for a billion eons. With these roots of virtue, gentle and agreeable acts of a beginner, he pleased a billion buddhas. He constantly honored, worshiped, and venerated all of them and supplied them with flowers, incense, perfumes, garlands, ointments, aromatic powders, clothes, parasols, banners and flags, robes, and offerings of food, beds, seats, medicine for the sick, and utensils. Then, after incalculable eons, he fully realized the unsurpassable state of full awakening. He appeared in the world as a tathāgata, arhat, fully accomplished buddha by the name of Susaṃgṛhita. He was perfect in wisdom and conduct, and so forth, awakened, a lord. He remained for two hundred million eons and had two thousand million billion śrāvakas, arhats who had eliminated defilements, who were free from vices, who possessed powers, and so forth, and who had reached the very highest level of complete mastery of the mind—a great assembly of śrāvakas. He established fifty million bodhisatvas in the state of unsurpassed perfect awakening. He taught the Dharma, benefitting uncountable, innumerable sentient beings, and then passed into nirvāṇa. After this lord had attained final nirvāṇa, the true Dharma remained for a thousand years, and his relics were spread far and wide, just as my relics, Śāriputra, will be spread far and wide after I pass into final nirvāṇa.

source: ཤཱ་རིའི་བུ་རས་ཀྱི་ཁ་ཚར་ཕུལ་བ་དང་། སེམས་བསྐྱེད་པས་ཀྱང་མཐར་གྱིས་སངས་རྒྱས་ཀྱི་ཆོས་ཡོངས་སུ་རྫོགས་པ་ལ་ལྟོས། ཤཱ་རིའི་བུ་སེམས་ནི་རྒྱ་ཆེ་བའི་སྦྱིན་པ་ནི་མ་ཡིན་ནོ། ། ཤཱ་རིའི་བུ་གལ་ཏེ་སྦྱིན་པ་རྒྱ་ཆེ་ལ་སེམས་ཀྱིས་མ་ཡིན་ན་ནི་སྦྱིན་བདག་རྩུབ་མོ་ཞེས་བྱ་བ་ལྟར་འགྱུར་ཏེ། དེས་སྦྱིན་པ་དེ་སྙེད་བྱིན་ཡང་སེམས་ཡོངས་སུ་མ་སྦྱངས་སོ། །
en: “You should observe, Śāriputra, that it was because of his motivation for giving the cloth that he in turn could eventually accomplish the qualities of the Buddha. Śāriputra, it is the motivation that is great, and not the gift. Giving a great gift, Śāriputra, without the proper motivation, is simply crude. However many gifts one might give, one’s mind will not be purified.

source: ཤཱ་རིའི་བུ་འཇིག་རྟེན་གྱི་ཟང་ཟིང་ལ་གནས་ཏེ། ཐམས་ཅད་ཡོངས་སུ་ཐོབ་པར་གྱུར་པ་ལ་ལྟོས། ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་མཁས་པ་ནི་སྦྱིན་པ་ཉུང་ངུ་ཡང་མང་པོར་བྱེད་དོ། ། ཡེ་ཤེས་ཀྱི་སྟོབས་ཀྱིས་ལྷག་པར་བྱེད་དོ། ། ཤེས་རབ་ཀྱི་སྟོབས་ཀྱིས་རྒྱས་པར་བྱེད་དོ། ། བསྔོ་བའི་སྟོབས་ཀྱིས་དཔག་ཏུ་མེད་པར་བྱེད་དོ། །
en: “You should observe, Śāriputra, that it is in relying on the material world that everything is accomplished. The learned bodhisatva, Śāriputra, will perform acts of great generosity with few things. What he does is superior because it is done with the power of knowledge. It is vast because it is done with the power of wisdom. It is immeasurable because it is done through the power that comes from dedicating.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དོན་དེ་ཉིད་རྒྱ་ཆེར་རབ་ཏུ་བསྟན་པའི་ཕྱིར་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་གསུངས་སོ། །
en: Then, in order to clarify this point further, the Lord went on to speak these verses:

source: གཟུགས་འདོད་ཕྱིར་ནི་སྦྱིན་པ་སྦྱིན་མི་བྱེད། །
en: “They are not generous out of desire for physical objects,

source: ལོངས་སྤྱོད་མཐོ་རིས་འདོད་ཕྱིར་མ་ཡིན་གྱི། །བླ་ན་མེད་པའི་སངས་རྒྱས་མཆོག་འདོད་ཕྱིར། །དེ་ཕྱིར་སྦྱིན་པ་ཆུང་ཡང་དུ་མར་འགྱུར། །
en: Or out of desire for pleasure or for heaven, But out of desire for unsurpassed supreme awakening. Thus even a little generosity is multiplied.

source: གྲགས་དང་བརྗོད་པ་དག་དང་སྒྲ་དག་དང་། །གཡོག་དང་བདེ་བ་ནམ་ཡང་མི་འདོད་ཅིང་། །འཆི་འཕོ་སྐྱེ་བ་ཀུན་ཀྱང་མི་འདོད་དེ། །
en: “They never wish for glory or fame, For agreeable words, followers, or comfort. They have no interest in death or rebirth.

source: དེ་ཕྱིར་སྦྱིན་ཉུང་འབྲས་བུ་ཆེན་པོར་འགྱུར། །
en: Thus even a little generosity yields great results.

source: ཟས་དང་སྐོམ་དང་ཆོས་གོས་གང་སྦྱིན་པ། །སྲིད་པའི་འགྲོ་བ་འདོད་ཕྱིར་མ་ཡིན་ཏེ། །
en: “They give food, drink, and clothing Without being interested in any of the states of existence of this world.

source: སྦྱིན་པས་འཆི་བ་མེད་པའི་སྒོ་བཙལ་ཕྱིར། །དེ་ནི་སྐྲ་རྩེ་ཙམ་ཡང་སྦྱིན་པ་སྦྱིན། །
en: One who is generous and who seeks out the door to the deathless Can find it in a gift as small as the tip of a hair.

source: འཕྱར་བ་མེད་ཅིང་ཁེངས་པ་མེད་པར་འགྱུར། །
en: “They are not haughty, they are not arrogant.

source: གཡོ་དང་སེར་སྣ་དག་ནི་ཐམས་ཅད་སྤོང་། །
en: They give up all falsity and miserliness,
